<template lang="pug">
    .about-page
        p.text-h3 Тестовое задание SquareGPS
        p.text-body-1
            | Необходимо с помощью Vuejs, Vuex, VueRouter, Vuetify написать приложение.
            | Хэдер приложения должен содержать меню из 2-х пунктов: О Задании, Карта. 
            | В основной части приложения должно отображаться содержимое разделов.
        p.text-h4 Раздел “О задании”
        p.text-body-1 В разделе должен быть текст этого задания, сверстанный аналогично.
        p.text-h4  Раздел “Карта”
        p.text-body-1 
            | На экране должны быть карта и список (см пример):
            ol 
                li При клике на кнопку добавления, карта должна перейти в режим добавления маркера: в месте клика должен появится маркер, а в списке - запись с координатами 
                li При клике на маркер должна подсвечиваться запись в списке
                li При клике на запись в списке карта должна центрироваться на маркере
                li Маркеры должны храниться локально и не пропадать после перезагрузки страницы 
                li В адресной строке должен отображаться id выбранного маркера
        p.text-h5.font-weight-bold Дополнительно:
        p.text-body-1
            ol 
                li Продумать отображение на мобильных устройствах
                li Предусмотреть локализацию
                li Необходимо с помощью jest написать 1 модульный тест на любой компонент 
                li Произвести имитацию сохранения данных на бекенд (асинхронно)
        p.text-body-1 Пример: 
        p.text-center
            v-img.mx-lg-auto(
                :max-width="700"
                :lazy-src="require('@/assets/images/task-example.png')"
                :src="require('@/assets/images/task-example.png')"
            )
</template>

<script>
export default {

}
</script>

<style>

</style>